In [1]:
import sqlite3

In [2]:
db = sqlite3.connect('mytestbase.db')

In [3]:
cursor = db.cursor()

In [5]:
cursor.execute('create Table score1(gender Text,student_id INT primary key,marks INT)')

In [6]:
cursor.execute("Insert into score1(gender,student_id,marks) values('Male',100,55),('Female',102,68),('Female',103,60)")

db.commit()

print(cursor.rowcount,'Records_inserted')

3 Records_inserted

In [8]:
cursor.execute('Select * From score1')

In [9]:
import pandas as pd

In [10]:
df = pd.DataFrame(cursor.fetchall())
print(df)

        0    1   2
0    Male  100  55
1  Female  102  68
2  Female  103  60

In [12]:
cursor.description

(('gender', None, None, None, None, None, None),
 ('student_id', None, None, None, None, None, None),
 ('marks', None, None, None, None, None, None))

In [14]:
df.columns = (x[0] for x in cursor.description)

In [15]:
df.head()

   gender  student_id  marks
0    Male         100     55
1  Female         102     68
2  Female         103     60

In [16]:
sql = 'Drop table score1'
cursor.execute(sql)